app/controllers/friends_controller.rb

  def index
    @friends = Friend.all
---
SELECT "friends".* FROM "friends"

  def friends_user
    @friends = @user.friends.all
---
SELECT "friends".* FROM "friends" WHERE "friends"."user_id" = ?  [["user_id", 1]]

    def set_friend
      @friend = Friend.find(params[:id])
---
SELECT  "friends".* FROM "friends" WHERE "friends"."id" = ? LIMIT ?  [["id", 0], ["LIMIT", 1]]