app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "Baryonaute"], ["LIMIT", 1]]
---
  def login
    if User.find_by(email: params[:email])

INSERT INTO "users" ("password", "firstName", "lastName", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["password", "test"], ["firstName", "Charlie"], ["lastName", "Naudy"], ["address", "119 B Rue de Paris, 92100"], ["created_at", 2017-02-13 17:57:21 UTC], ["updated_at", 2017-02-13 17:57:21 UTC]]
---
  def create
    @user = User.new(user_params)

    if @user.save